Revit 2026 API

# LightFamilySetLightShapeStyle Method

---

Set the light shape style to the given shape style

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLightShapeStyle(
	LightShapeStyle lightShapeStyle
)
```
```vb
Public Sub SetLightShapeStyle (
	lightShapeStyle As LightShapeStyle
)
```
```cpp
public:
void SetLightShapeStyle(
	LightShapeStyle lightShapeStyle
)
```
```fsharp
member SetLightShapeStyle :
        lightShapeStyle : LightShapeStyle -> unit
```

#### Parameters

lightShapeStyle LightShapeStyle
     The light shape style value to set the light shape style to

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

LightFamily Class

Autodesk.Revit.DB.Lighting Namespace